//1.Ստեղծել օբեկտ որում կա երկու հատկություն՝ այցելուի էկրանի լայնությունը և բարձրությունը: Ստեղծել կոճակ որին սեղմելիս կիմանաք այդ արժեքները:
//
// 2.Գրել ծրագիր , որը կստուգի եթե այցելու էկրանի չափը փոքր է 768px ապա հղումը փոխի դեպի m.facebook.com, այլապես facebook.com(location.replace())
//
// 3.Ունենք form , որով այցելուն մուտքագրում է իր էլ. հասցեն  և submit անում:
// Ստեղծել ծրագիր , որը չերևացող input որպես value կգրի YES եթե այցելու բրաուզերը  Chrome (navigator.userAgent.indexOf("Chrome")) է և NO եթե այլ բրաուզեր է : Submit ժամանակ այդ արժեքը նույնպես պետք է ուղարկվի սերվեր:
// Submit ժամանակ արտածել input value-ները (, իսկ event.preventDefault() Submit ժամանակ գործողությունը կանգնեցնելու համար):
//
// 4.Ունենք հղում դեպի sunnyschool.am:Գրել ծրագիր որ այցելուն երբ սեղմի հղման լրացուցիչ հարց ստանա արդյոք հղում բացի նոր window թե նույնի  մեջ:
// Եթե այցելուն confirm անի թող բացի նոր window մեջ, եթե ոչ ապա նույն էջում բացի Sunny School կայքը:
//
// 5.Ունենք HTML,CSS,Bootstrap,JavaScript, jQuery, Node.JS զանգված: Գրել ծրագիր որով այցելու կարող է թերթել այս ցանկի բոլոր անդամներ երբ սեղմի առաջ կամ հետ գնալու կոճակներ,
// կամ ծրագիրը ավտոմատ 3 վարկյան մեկ փոխի:Էջը բացելիս պետք է երևա զանգված առաջին անդամը, երբ առաջ գնալով հասնենք վերջին անդամին (Node.JS) դրանից հետո առաջ սեղմելիս երևա կրկին առաջին անդամը,
// իսկ երբ առաջին անդամից հետ ուզենք գնանք երևա զանգվածի վերջին անդամը (Նկ. Home5.jpg):


