//1.Ստեղծել ֆունկցիա, որը որպես պարամետր ընդունում է կամայական քանակությամբ թվեր և ստեղծում է մի նոր զանգված իրեն փոխանցած այն արգումենտներից, որոնք պարունակում են զրո թվանշան:
//
// 2.Ունենք զանգված : Կլոնավորել այդ զանգվածը այնպես, որ նոր զանգվածին անդամ ավելացնենք հինը չփոխվի(spread operator):
//
// 3.Գրել ֆունկցիա , որը գեներացնում է պատահական թիվ 0 ից 10 միջակայքում , թիվը 5ից փոքր լինելու դեպքում կանչում է callback-ը 'success' արժեքով , իսկ հակառակ դեպքում 'error' արժեքով։
// callback-ի մեջ տպել արժեքը։
//
// 4.ՈՒնենք բառերի զանգված: Ստեղծել ֆունկցիա որը զանգվածից կհեռացնի նույն տառերը ունեցող բառերը(կթողնի միայն մեկը) ընդորում մեծատառ փոքրատառ կապ չունի և կվերադարձնի նոր զանգված :
// Օրինակ՝
// ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"] -> [PAN, hectares, era];
// Օգտագործել Map
//
// 5.Ստեղծել Cart անունով constructor ֆունկցիա ․ Այն պետք է ունենա մեթոդ addProduct , որով կկրողանանք հավաքել ապրանքներ ։ Ամեն ապրանքը օբեկտ է , որը ունի անուն և գին հատկություն։
// Ավելացնել մեթոդ , որը կվերադարձնի ավբողջ գումարը հավաքված ապրանքների։ 